// // Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.
// const num = 6
// console.log(Math.sign(num))
//
// // Дана строка. Выведите в консоль длину этой строки.
// const str = 'Дана строка. Выведите в консоль длину этой строки'
// console.log(str.length)
// // Дана строка. Выведите в консоль последний символ строки.
// console.log(str[str.length - 1])
//
// // Дано число. Проверьте, четное оно или нет.
// console.log(num % 2)
//
// // Даны два слова. Проверьте, что первые буквы этих слов совпадают.
// const wordOne = 'JavaScript'
// const wordTwo = 'JS'
// console.log(wordOne[0] === wordTwo[0])
//
// // Дано слово. Получите его последнюю букву.
// const word = 'Камень'
// const wordLast = word.slice(-1)
// console.log(wordLast)

// Дано число. Выведите в консоль первую цифру этого числа.
// let num = 132
// // console.log(num.toString()[0])
//
// // Дано число. Выведите в консоль последнюю цифру этого числа.
// // console.log(num.toString().length - 1)
//
// // Дано число. Выведите в консоль сумму первой и последней цифры этого числа.
// // console.log(+num.toString()[0] + (+num.toString().length - 1))
//
// // Дано число. Выведите количество цифр в этом числе.
// // console.log(num.toString().length)
//
// // Даны два числа. Проверьте, что первые цифры этих чисел совпадают.
// let num2 = 1233
// console.log(num[0] === num2[0])

